Revit 2026 API

# IFCParameterTemplateSetInSessionTemplateDocument Method

---

Set document for in-session template.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetInSessionTemplateDocument(
	Document document
)
```
```vb
Public Sub SetInSessionTemplateDocument (
	document As Document
)
```
```cpp
public:
void SetInSessionTemplateDocument(
	Document^ document
)
```
```fsharp
member SetInSessionTemplateDocument :
        document : Document -> unit
```

#### Parameters

document Document
     The Revit document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The template is not an is-session. |

The document is used for non built-in parameters mapping.

#### Reference

IFCParameterTemplate Class

Autodesk.Revit.DB Namespace